iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K148_GHS/targetInit/S32K148_sfr.h
};

#define AIPS (*(volatile struct AIPS_tag *) 0x40000000)

struct MSCM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RYPZ:8;
      uint64_t PERSONALITY:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCM_CPxTYPE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCM_CPxNUM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPMN:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCM_CPxMASTER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCNT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCM_CPxCOUNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCWY:8;
      uint64_t DCSZ:8;
      uint64_t ICWY:8;
      uint64_t ICSZ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCM_CPxCFG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t L2WY:8;
      uint64_t L2SZ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCM_CPxCFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t TMUSZ:8;
      uint64_t reservedSpace1:8;
      uint64_t TMLSZ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCM_CPxCFG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FPU:1;
      uint64_t SIMD:1;
      uint64_t JAZ:1;
      uint64_t MMU:1;
      uint64_t TZ:1;
      uint64_t CMP:1;
      uint64_t BB:1;
      uint64_t reservedSpace0:1;
      uint64_t SBP:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCM_CPxCFG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RYPZ:8;
      uint64_t PERSONALITY:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCM_CP0TYPE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCM_CP0NUM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPMN:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCM_CP0MASTER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCNT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCM_CP0COUNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCWY:8;
      uint64_t DCSZ:8;
      uint64_t ICWY:8;
      uint64_t ICSZ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCM_CP0CFG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t L2WY:8;
      uint64_t L2SZ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCM_CP0CFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t TMUSZ:8;
      uint64_t reservedSpace1:8;
      uint64_t TMLSZ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCM_CP0CFG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FPU:1;
      uint64_t SIMD:1;
      uint64_t JAZ:1;
      uint64_t MMU:1;
      uint64_t TZ:1;
      uint64_t CMP:1;
      uint64_t BB:1;
      uint64_t reservedSpace0:1;
      uint64_t SBP:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCM_CP0CFG3;

  uint8_t res0[960];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OCM0:4;
      uint64_t OCM1:4;
      uint64_t OCM2:4;
      uint64_t OCMPU:1;
      uint64_t OCMT:3;
      uint64_t RO:1;
      uint64_t OCMW:3;
      uint64_t reservedSpace0:4;
      uint64_t OCMSZ:4;
      uint64_t OCMSZH:1;
      uint64_t reservedSpace1:2;
      uint64_t V:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCM_OCMDR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OCM0:4;
      uint64_t OCM1:4;
      uint64_t OCM2:4;
      uint64_t OCMPU:1;
      uint64_t OCMT:3;
      uint64_t RO:1;
      uint64_t OCMW:3;
      uint64_t reservedSpace0:4;
      uint64_t OCMSZ:4;
      uint64_t OCMSZH:1;
      uint64_t reservedSpace1:2;
      uint64_t V:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCM_OCMDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OCM0:4;
      uint64_t OCM1:4;
      uint64_t OCM2:4;
      uint64_t OCMPU:1;
      uint64_t OCMT:3;
      uint64_t RO:1;
      uint64_t OCMW:3;
      uint64_t reservedSpace0:4;
      uint64_t OCMSZ:4;
      uint64_t OCMSZH:1;
      uint64_t reservedSpace1:2;
      uint64_t V:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCM_OCMDR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OCM0:4;
      uint64_t OCM1:4;
      uint64_t OCM2:4;
      uint64_t OCMPU:1;
      uint64_t OCMT:3;
      uint64_t RO:1;
      uint64_t OCMW:3;
      uint64_t reservedSpace0:4;
      uint64_t OCMSZ:4;
      uint64_t OCMSZH:1;
      uint64_t reservedSpace1:2;
      uint64_t V:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSCM_OCMDR3;

};

#define MSCM (*(volatile struct MSCM_tag *) 0x40001000)

struct MPU_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLD:1;
      uint64_t reservedSpace0:7;
      uint64_t NRGD:4;
      uint64_t NSP:4;
      uint64_t HRL:4;
      uint64_t reservedSpace1:7;
      uint64_t SPERR4:1;
      uint64_t SPERR3:1;
      uint64_t SPERR2:1;
      uint64_t SPERR1:1;
      uint64_t SPERR0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_CESR;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_EAR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERW:1;
      uint64_t EATTR:3;
      uint64_t EMN:4;
      uint64_t EPID:8;
      uint64_t EACD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_EDR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_EAR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERW:1;
      uint64_t EATTR:3;
      uint64_t EMN:4;
      uint64_t EPID:8;
      uint64_t EACD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_EDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_EAR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERW:1;
      uint64_t EATTR:3;
      uint64_t EMN:4;
      uint64_t EPID:8;
      uint64_t EACD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_EDR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_EAR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERW:1;
      uint64_t EATTR:3;
      uint64_t EMN:4;
      uint64_t EPID:8;
      uint64_t EACD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_EDR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_EAR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERW:1;
      uint64_t EATTR:3;
      uint64_t EMN:4;
      uint64_t EPID:8;
      uint64_t EACD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_EDR4;

