iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K148_GHS/targetInit/S32K148_sfr.h
  uint8_t res1[968];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t SRTADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD0_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t ENDADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD0_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0UM:3;
      uint64_t M0SM:2;
      uint64_t M0PE:1;
      uint64_t M1UM:3;
      uint64_t M1SM:2;
      uint64_t M1PE:1;
      uint64_t M2UM:3;
      uint64_t M2SM:2;
      uint64_t reservedSpace0:1;
      uint64_t M3UM:3;
      uint64_t M3SM:2;
      uint64_t reservedSpace1:1;
      uint64_t M4WE:1;
      uint64_t M4RE:1;
      uint64_t M5WE:1;
      uint64_t M5RE:1;
      uint64_t M6WE:1;
      uint64_t M6RE:1;
      uint64_t M7WE:1;
      uint64_t M7RE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD0_WORD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLD:1;
      uint64_t reservedSpace0:15;
      uint64_t PIDMASK:8;
      uint64_t PID:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD0_WORD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t SRTADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD1_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t ENDADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD1_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0UM:3;
      uint64_t M0SM:2;
      uint64_t M0PE:1;
      uint64_t M1UM:3;
      uint64_t M1SM:2;
      uint64_t M1PE:1;
      uint64_t M2UM:3;
      uint64_t M2SM:2;
      uint64_t reservedSpace0:1;
      uint64_t M3UM:3;
      uint64_t M3SM:2;
      uint64_t reservedSpace1:1;
      uint64_t M4WE:1;
      uint64_t M4RE:1;
      uint64_t M5WE:1;
      uint64_t M5RE:1;
      uint64_t M6WE:1;
      uint64_t M6RE:1;
      uint64_t M7WE:1;
      uint64_t M7RE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD1_WORD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLD:1;
      uint64_t reservedSpace0:15;
      uint64_t PIDMASK:8;
      uint64_t PID:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD1_WORD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t SRTADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD2_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t ENDADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD2_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0UM:3;
      uint64_t M0SM:2;
      uint64_t M0PE:1;
      uint64_t M1UM:3;
      uint64_t M1SM:2;
      uint64_t M1PE:1;
      uint64_t M2UM:3;
      uint64_t M2SM:2;
      uint64_t reservedSpace0:1;
      uint64_t M3UM:3;
      uint64_t M3SM:2;
      uint64_t reservedSpace1:1;
      uint64_t M4WE:1;
      uint64_t M4RE:1;
      uint64_t M5WE:1;
      uint64_t M5RE:1;
      uint64_t M6WE:1;
      uint64_t M6RE:1;
      uint64_t M7WE:1;
      uint64_t M7RE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD2_WORD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLD:1;
      uint64_t reservedSpace0:15;
      uint64_t PIDMASK:8;
      uint64_t PID:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD2_WORD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t SRTADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD3_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t ENDADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD3_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0UM:3;
      uint64_t M0SM:2;
      uint64_t M0PE:1;
      uint64_t M1UM:3;
      uint64_t M1SM:2;
      uint64_t M1PE:1;
      uint64_t M2UM:3;
      uint64_t M2SM:2;
      uint64_t reservedSpace0:1;
      uint64_t M3UM:3;
      uint64_t M3SM:2;
      uint64_t reservedSpace1:1;
      uint64_t M4WE:1;
      uint64_t M4RE:1;
      uint64_t M5WE:1;
      uint64_t M5RE:1;
      uint64_t M6WE:1;
      uint64_t M6RE:1;
      uint64_t M7WE:1;
      uint64_t M7RE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD3_WORD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLD:1;
      uint64_t reservedSpace0:15;
      uint64_t PIDMASK:8;
      uint64_t PID:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD3_WORD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t SRTADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD4_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t ENDADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD4_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0UM:3;
      uint64_t M0SM:2;
      uint64_t M0PE:1;
      uint64_t M1UM:3;
      uint64_t M1SM:2;
      uint64_t M1PE:1;
      uint64_t M2UM:3;
      uint64_t M2SM:2;
      uint64_t reservedSpace0:1;
      uint64_t M3UM:3;
      uint64_t M3SM:2;
      uint64_t reservedSpace1:1;
      uint64_t M4WE:1;
      uint64_t M4RE:1;
      uint64_t M5WE:1;
      uint64_t M5RE:1;
      uint64_t M6WE:1;
      uint64_t M6RE:1;
      uint64_t M7WE:1;
      uint64_t M7RE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD4_WORD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLD:1;
      uint64_t reservedSpace0:15;
      uint64_t PIDMASK:8;
      uint64_t PID:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD4_WORD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t SRTADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD5_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t ENDADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD5_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0UM:3;
      uint64_t M0SM:2;
      uint64_t M0PE:1;
      uint64_t M1UM:3;
      uint64_t M1SM:2;
      uint64_t M1PE:1;
      uint64_t M2UM:3;
      uint64_t M2SM:2;
      uint64_t reservedSpace0:1;
      uint64_t M3UM:3;
      uint64_t M3SM:2;
      uint64_t reservedSpace1:1;
      uint64_t M4WE:1;
      uint64_t M4RE:1;
      uint64_t M5WE:1;
      uint64_t M5RE:1;
      uint64_t M6WE:1;
      uint64_t M6RE:1;
      uint64_t M7WE:1;
      uint64_t M7RE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD5_WORD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLD:1;
      uint64_t reservedSpace0:15;
      uint64_t PIDMASK:8;
      uint64_t PID:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD5_WORD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t SRTADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD6_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t ENDADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD6_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0UM:3;
      uint64_t M0SM:2;
      uint64_t M0PE:1;
      uint64_t M1UM:3;
      uint64_t M1SM:2;
      uint64_t M1PE:1;
      uint64_t M2UM:3;
      uint64_t M2SM:2;
      uint64_t reservedSpace0:1;
      uint64_t M3UM:3;
      uint64_t M3SM:2;
      uint64_t reservedSpace1:1;
      uint64_t M4WE:1;
      uint64_t M4RE:1;
      uint64_t M5WE:1;
      uint64_t M5RE:1;
      uint64_t M6WE:1;
      uint64_t M6RE:1;
      uint64_t M7WE:1;
      uint64_t M7RE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD6_WORD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLD:1;
      uint64_t reservedSpace0:15;
      uint64_t PIDMASK:8;
      uint64_t PID:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD6_WORD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t SRTADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD7_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t ENDADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD7_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0UM:3;
      uint64_t M0SM:2;
      uint64_t M0PE:1;
      uint64_t M1UM:3;
      uint64_t M1SM:2;
      uint64_t M1PE:1;
      uint64_t M2UM:3;
      uint64_t M2SM:2;
      uint64_t reservedSpace0:1;
      uint64_t M3UM:3;
      uint64_t M3SM:2;
      uint64_t reservedSpace1:1;
      uint64_t M4WE:1;
      uint64_t M4RE:1;
      uint64_t M5WE:1;
      uint64_t M5RE:1;
      uint64_t M6WE:1;
      uint64_t M6RE:1;
      uint64_t M7WE:1;
      uint64_t M7RE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD7_WORD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLD:1;
      uint64_t reservedSpace0:15;
      uint64_t PIDMASK:8;
      uint64_t PID:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD7_WORD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t SRTADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD8_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t ENDADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD8_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0UM:3;
      uint64_t M0SM:2;
      uint64_t M0PE:1;
      uint64_t M1UM:3;
      uint64_t M1SM:2;
      uint64_t M1PE:1;
      uint64_t M2UM:3;
      uint64_t M2SM:2;
      uint64_t reservedSpace0:1;
      uint64_t M3UM:3;
      uint64_t M3SM:2;
      uint64_t reservedSpace1:1;
      uint64_t M4WE:1;
      uint64_t M4RE:1;
      uint64_t M5WE:1;
      uint64_t M5RE:1;
      uint64_t M6WE:1;
      uint64_t M6RE:1;
      uint64_t M7WE:1;
      uint64_t M7RE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD8_WORD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLD:1;
      uint64_t reservedSpace0:15;
      uint64_t PIDMASK:8;
      uint64_t PID:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD8_WORD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t SRTADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD9_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t ENDADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD9_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0UM:3;
      uint64_t M0SM:2;
      uint64_t M0PE:1;
      uint64_t M1UM:3;
      uint64_t M1SM:2;
      uint64_t M1PE:1;
      uint64_t M2UM:3;
      uint64_t M2SM:2;
      uint64_t reservedSpace0:1;
      uint64_t M3UM:3;
      uint64_t M3SM:2;
      uint64_t reservedSpace1:1;
      uint64_t M4WE:1;
      uint64_t M4RE:1;
      uint64_t M5WE:1;
      uint64_t M5RE:1;
      uint64_t M6WE:1;
      uint64_t M6RE:1;
      uint64_t M7WE:1;
      uint64_t M7RE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD9_WORD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLD:1;
      uint64_t reservedSpace0:15;
      uint64_t PIDMASK:8;
      uint64_t PID:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD9_WORD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t SRTADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD10_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t ENDADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD10_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0UM:3;
      uint64_t M0SM:2;
      uint64_t M0PE:1;
      uint64_t M1UM:3;
      uint64_t M1SM:2;
      uint64_t M1PE:1;
      uint64_t M2UM:3;
      uint64_t M2SM:2;
      uint64_t reservedSpace0:1;
      uint64_t M3UM:3;
      uint64_t M3SM:2;
      uint64_t reservedSpace1:1;
      uint64_t M4WE:1;
      uint64_t M4RE:1;
      uint64_t M5WE:1;
      uint64_t M5RE:1;
      uint64_t M6WE:1;
      uint64_t M6RE:1;
      uint64_t M7WE:1;
      uint64_t M7RE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD10_WORD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLD:1;
      uint64_t reservedSpace0:15;
      uint64_t PIDMASK:8;
      uint64_t PID:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD10_WORD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t SRTADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD11_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t ENDADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD11_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0UM:3;
      uint64_t M0SM:2;
      uint64_t M0PE:1;
      uint64_t M1UM:3;
      uint64_t M1SM:2;
      uint64_t M1PE:1;
      uint64_t M2UM:3;
      uint64_t M2SM:2;
      uint64_t reservedSpace0:1;
      uint64_t M3UM:3;
      uint64_t M3SM:2;
      uint64_t reservedSpace1:1;
      uint64_t M4WE:1;
      uint64_t M4RE:1;
      uint64_t M5WE:1;
      uint64_t M5RE:1;
      uint64_t M6WE:1;
      uint64_t M6RE:1;
      uint64_t M7WE:1;
      uint64_t M7RE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD11_WORD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLD:1;
      uint64_t reservedSpace0:15;
      uint64_t PIDMASK:8;
      uint64_t PID:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD11_WORD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t SRTADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD12_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t ENDADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD12_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0UM:3;
      uint64_t M0SM:2;
      uint64_t M0PE:1;
      uint64_t M1UM:3;
      uint64_t M1SM:2;
      uint64_t M1PE:1;
      uint64_t M2UM:3;
      uint64_t M2SM:2;
      uint64_t reservedSpace0:1;
      uint64_t M3UM:3;
      uint64_t M3SM:2;
      uint64_t reservedSpace1:1;
      uint64_t M4WE:1;
      uint64_t M4RE:1;
      uint64_t M5WE:1;
      uint64_t M5RE:1;
      uint64_t M6WE:1;
      uint64_t M6RE:1;
      uint64_t M7WE:1;
      uint64_t M7RE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD12_WORD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLD:1;
      uint64_t reservedSpace0:15;
      uint64_t PIDMASK:8;
      uint64_t PID:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD12_WORD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t SRTADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD13_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t ENDADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD13_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0UM:3;
      uint64_t M0SM:2;
      uint64_t M0PE:1;
      uint64_t M1UM:3;
      uint64_t M1SM:2;
      uint64_t M1PE:1;
      uint64_t M2UM:3;
      uint64_t M2SM:2;
      uint64_t reservedSpace0:1;
      uint64_t M3UM:3;
      uint64_t M3SM:2;
      uint64_t reservedSpace1:1;
      uint64_t M4WE:1;
      uint64_t M4RE:1;
      uint64_t M5WE:1;
      uint64_t M5RE:1;
      uint64_t M6WE:1;
      uint64_t M6RE:1;
      uint64_t M7WE:1;
      uint64_t M7RE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD13_WORD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLD:1;
      uint64_t reservedSpace0:15;
      uint64_t PIDMASK:8;
      uint64_t PID:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD13_WORD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t SRTADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD14_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t ENDADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD14_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0UM:3;
      uint64_t M0SM:2;
      uint64_t M0PE:1;
      uint64_t M1UM:3;
      uint64_t M1SM:2;
      uint64_t M1PE:1;
      uint64_t M2UM:3;
      uint64_t M2SM:2;
      uint64_t reservedSpace0:1;
      uint64_t M3UM:3;
      uint64_t M3SM:2;
      uint64_t reservedSpace1:1;
      uint64_t M4WE:1;
      uint64_t M4RE:1;
      uint64_t M5WE:1;
      uint64_t M5RE:1;
      uint64_t M6WE:1;
      uint64_t M6RE:1;
      uint64_t M7WE:1;
      uint64_t M7RE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD14_WORD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLD:1;
      uint64_t reservedSpace0:15;
      uint64_t PIDMASK:8;
      uint64_t PID:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD14_WORD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t SRTADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD15_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t ENDADDR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD15_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0UM:3;
      uint64_t M0SM:2;
      uint64_t M0PE:1;
      uint64_t M1UM:3;
      uint64_t M1SM:2;
      uint64_t M1PE:1;
      uint64_t M2UM:3;
      uint64_t M2SM:2;
      uint64_t reservedSpace0:1;
      uint64_t M3UM:3;
      uint64_t M3SM:2;
      uint64_t reservedSpace1:1;
      uint64_t M4WE:1;
      uint64_t M4RE:1;
      uint64_t M5WE:1;
      uint64_t M5RE:1;
      uint64_t M6WE:1;
      uint64_t M6RE:1;
      uint64_t M7WE:1;
      uint64_t M7RE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD15_WORD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLD:1;
      uint64_t reservedSpace0:15;
      uint64_t PIDMASK:8;
      uint64_t PID:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPU_RGD15_WORD3;

