iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K148_GHS/targetInit/S32K148_sfr.h
  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUF31TO0M:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_IMASK1;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUF0I:1;
      uint64_t BUF4TO1I:4;
      uint64_t BUF5I:1;
      uint64_t BUF6I:1;
      uint64_t BUF7I:1;
      uint64_t BUF31TO8I:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_IFLAG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:11;
      uint64_t EDFLTDIS:1;
      uint64_t ISOCANFDEN:1;
      uint64_t reservedSpace1:1;
      uint64_t PREXCEN:1;
      uint64_t TIMER_SRC:1;
      uint64_t EACEN:1;
      uint64_t RRS:1;
      uint64_t MRP:1;
      uint64_t TASD:5;
      uint64_t RFFN:4;
      uint64_t reservedSpace2:2;
      uint64_t BOFFDONEMSK:1;
      uint64_t ERRMSK_FAST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_CTRL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:13;
      uint64_t IMB:1;
      uint64_t VPS:1;
      uint64_t reservedSpace1:1;
      uint64_t LPTM:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_ESR2;

  uint8_t res3[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXCRC:15;
      uint64_t reservedSpace0:1;
      uint64_t MBCRC:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_CRCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FGM:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_RXFGMASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDHIT:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_RXFIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EPSEG2:5;
      uint64_t EPSEG1:5;
      uint64_t EPROPSEG:6;
      uint64_t ERJW:5;
      uint64_t EPRESDIV:10;
      uint64_t BTF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_CBT;

  uint8_t res4[44];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM32;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM33;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM35;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM36;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM37;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM38;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM39;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM40;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM41;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM42;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM43;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM44;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM45;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM46;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM47;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM48;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM49;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM50;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM51;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM52;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM53;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM54;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM55;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM56;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM57;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM58;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM59;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM60;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM61;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM62;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM63;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM64;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM65;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM66;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM67;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM68;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM69;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM70;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM71;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM72;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM73;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM74;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM75;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM76;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM77;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM78;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM79;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM80;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM81;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM82;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM83;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM84;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM85;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN0_EmbeddedRAM86;

