iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K148_GHS/targetInit/S32K148_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM75;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM76;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM77;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM78;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM79;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM80;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM81;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM82;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM83;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM84;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM85;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM86;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM87;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM88;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM89;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM90;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM91;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM92;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM93;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM94;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM95;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM96;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM97;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM98;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM99;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM100;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM101;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM102;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM103;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM104;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM105;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM106;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM107;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM108;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM109;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM110;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM111;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM112;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM113;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM114;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM115;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM116;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM117;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM118;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM119;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM120;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM121;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM122;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM123;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM124;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM125;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM126;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_EmbeddedRAM127;

  uint8_t res5[1536];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_RXIMR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_RXIMR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_RXIMR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_RXIMR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_RXIMR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_RXIMR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_RXIMR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_RXIMR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_RXIMR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_RXIMR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_RXIMR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_RXIMR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_RXIMR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_RXIMR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_RXIMR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_RXIMR15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_RXIMR16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_RXIMR17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_RXIMR18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_RXIMR19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_RXIMR20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_RXIMR21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_RXIMR22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_RXIMR23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_RXIMR24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_RXIMR25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_RXIMR26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_RXIMR27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_RXIMR28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_RXIMR29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_RXIMR30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN1_RXIMR31;

