iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K148_GHS/targetInit/S32K148_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM75;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM76;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM77;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM78;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM79;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM80;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM81;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM82;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM83;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM84;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM85;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM86;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM87;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM88;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM89;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM90;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM91;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM92;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM93;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM94;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM95;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM96;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM97;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM98;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM99;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM100;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM101;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM102;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM103;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM104;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM105;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM106;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM107;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM108;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM109;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM110;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM111;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM112;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM113;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM114;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM115;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM116;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM117;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM118;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM119;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM120;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM121;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM122;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM123;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM124;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM125;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM126;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BYTE_3:8;
      uint64_t DATA_BYTE_2:8;
      uint64_t DATA_BYTE_1:8;
      uint64_t DATA_BYTE_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_EmbeddedRAM127;

  uint8_t res5[1536];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_RXIMR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_RXIMR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_RXIMR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_RXIMR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_RXIMR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_RXIMR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_RXIMR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_RXIMR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_RXIMR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_RXIMR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_RXIMR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_RXIMR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_RXIMR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_RXIMR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_RXIMR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_RXIMR15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_RXIMR16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_RXIMR17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_RXIMR18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_RXIMR19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_RXIMR20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_RXIMR21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_RXIMR22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_RXIMR23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_RXIMR24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_RXIMR25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_RXIMR26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_RXIMR27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_RXIMR28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_RXIMR29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_RXIMR30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_RXIMR31;

