iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K148_GHS/targetInit/S32K148_sfr.h
  uint8_t res6[512];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCS:2;
      uint64_t IDFS:2;
      uint64_t PLFS:2;
      uint64_t reservedSpace0:2;
      uint64_t NMATCH:8;
      uint64_t WUMF_MSK:1;
      uint64_t WTOF_MSK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_CTRL1_PN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCHTO:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_CTRL2_PN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t MCOUNTER:8;
      uint64_t WUMF:1;
      uint64_t WTOF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_WU_MTC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLT_ID1:29;
      uint64_t FLT_RTR:1;
      uint64_t FLT_IDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_FLT_ID1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLT_DLC_HI:4;
      uint64_t reservedSpace0:12;
      uint64_t FLT_DLC_LO:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_FLT_DLC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Data_byte_3:8;
      uint64_t Data_byte_2:8;
      uint64_t Data_byte_1:8;
      uint64_t Data_byte_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_PL1_LO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Data_byte_7:8;
      uint64_t Data_byte_6:8;
      uint64_t Data_byte_5:8;
      uint64_t Data_byte_4:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_PL1_HI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLT_ID2_IDMASK:29;
      uint64_t RTR_MSK:1;
      uint64_t IDE_MSK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_FLT_ID2_IDMASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Data_byte_3:8;
      uint64_t Data_byte_2:8;
      uint64_t Data_byte_1:8;
      uint64_t Data_byte_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_PL2_PLMASK_LO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Data_byte_7:8;
      uint64_t Data_byte_6:8;
      uint64_t Data_byte_5:8;
      uint64_t Data_byte_4:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_PL2_PLMASK_HI;

  uint8_t res7[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DLC:4;
      uint64_t RTR:1;
      uint64_t IDE:1;
      uint64_t SRR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_WMB0_CS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_WMB0_ID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Data_byte_3:8;
      uint64_t Data_byte_2:8;
      uint64_t Data_byte_1:8;
      uint64_t Data_byte_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_WMB0_D03;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Data_byte_7:8;
      uint64_t Data_byte_6:8;
      uint64_t Data_byte_5:8;
      uint64_t Data_byte_4:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_WMB0_D47;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DLC:4;
      uint64_t RTR:1;
      uint64_t IDE:1;
      uint64_t SRR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_WMB1_CS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_WMB1_ID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Data_byte_3:8;
      uint64_t Data_byte_2:8;
      uint64_t Data_byte_1:8;
      uint64_t Data_byte_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_WMB1_D03;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Data_byte_7:8;
      uint64_t Data_byte_6:8;
      uint64_t Data_byte_5:8;
      uint64_t Data_byte_4:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_WMB1_D47;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DLC:4;
      uint64_t RTR:1;
      uint64_t IDE:1;
      uint64_t SRR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_WMB2_CS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_WMB2_ID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Data_byte_3:8;
      uint64_t Data_byte_2:8;
      uint64_t Data_byte_1:8;
      uint64_t Data_byte_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_WMB2_D03;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Data_byte_7:8;
      uint64_t Data_byte_6:8;
      uint64_t Data_byte_5:8;
      uint64_t Data_byte_4:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_WMB2_D47;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DLC:4;
      uint64_t RTR:1;
      uint64_t IDE:1;
      uint64_t SRR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_WMB3_CS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_WMB3_ID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Data_byte_3:8;
      uint64_t Data_byte_2:8;
      uint64_t Data_byte_1:8;
      uint64_t Data_byte_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_WMB3_D03;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Data_byte_7:8;
      uint64_t Data_byte_6:8;
      uint64_t Data_byte_5:8;
      uint64_t Data_byte_4:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_WMB3_D47;

  uint8_t res8[128];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDCVAL:6;
      uint64_t reservedSpace0:2;
      uint64_t TDCOFF:5;
      uint64_t reservedSpace1:1;
      uint64_t TDCFAIL:1;
      uint64_t TDCEN:1;
      uint64_t MBDSR0:2;
      uint64_t reservedSpace2:13;
      uint64_t FDRATE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_FDCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FPSEG2:3;
      uint64_t reservedSpace0:2;
      uint64_t FPSEG1:3;
      uint64_t reservedSpace1:2;
      uint64_t FPROPSEG:5;
      uint64_t reservedSpace2:1;
      uint64_t FRJW:3;
      uint64_t reservedSpace3:1;
      uint64_t FPRESDIV:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_FDCBT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD_TXCRC:21;
      uint64_t reservedSpace0:3;
      uint64_t FD_MBCRC:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAN2_FDCRC;

