iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K148_GHS/targetInit/S32K148_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTVAL:6;
      uint64_t DTPS:2;
      uint64_t reservedSpace0:8;
      uint64_t DTVALEX:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM7_PAIR1DEADTIME;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTVAL:6;
      uint64_t DTPS:2;
      uint64_t reservedSpace0:8;
      uint64_t DTVALEX:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM7_PAIR2DEADTIME;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTVAL:6;
      uint64_t DTPS:2;
      uint64_t reservedSpace0:8;
      uint64_t DTVALEX:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM7_PAIR3DEADTIME;

  uint8_t res3[324];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:11;
      uint64_t FRACMOD:5;
      uint64_t MOD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM7_MOD_MIRROR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:11;
      uint64_t FRACVAL:5;
      uint64_t VAL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM7_C0V_MIRROR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:11;
      uint64_t FRACVAL:5;
      uint64_t VAL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM7_C1V_MIRROR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:11;
      uint64_t FRACVAL:5;
      uint64_t VAL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM7_C2V_MIRROR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:11;
      uint64_t FRACVAL:5;
      uint64_t VAL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM7_C3V_MIRROR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:11;
      uint64_t FRACVAL:5;
      uint64_t VAL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM7_C4V_MIRROR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:11;
      uint64_t FRACVAL:5;
      uint64_t VAL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM7_C5V_MIRROR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:11;
      uint64_t FRACVAL:5;
      uint64_t VAL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM7_C6V_MIRROR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:11;
      uint64_t FRACVAL:5;
      uint64_t VAL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTM7_C7V_MIRROR;

};

#define FTM7 (*(volatile struct FTM7_tag *) 0x40071000)

struct ADC0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:6;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_SC1A;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:6;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_SC1B;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:6;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_SC1C;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:6;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_SC1D;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:6;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_SC1E;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:6;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_SC1F;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:6;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_SC1G;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:6;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_SC1H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:6;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_SC1I;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:6;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_SC1J;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:6;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_SC1K;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:6;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_SC1L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:6;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_SC1M;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:6;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_SC1N;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:6;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_SC1O;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:6;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_SC1P;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADICLK:2;
      uint64_t MODE:2;
      uint64_t reservedSpace0:1;
      uint64_t ADIV:2;
      uint64_t reservedSpace1:1;
      uint64_t CLRLTRG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SMPLTS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CFG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_RA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_RB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_RC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_RD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_RE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_RF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_RG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_RH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_RI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_RJ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_RK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_RL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_RM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_RN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_RO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_RP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CV1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CV2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REFSEL:2;
      uint64_t DMAEN:1;
      uint64_t ACREN:1;
      uint64_t ACFGT:1;
      uint64_t ACFE:1;
      uint64_t ADTRG:1;
      uint64_t ADACT:1;
      uint64_t reservedSpace0:5;
      uint64_t TRGPRNUM:2;
      uint64_t reservedSpace1:1;
      uint64_t TRGSTLAT:4;
      uint64_t reservedSpace2:4;
      uint64_t TRGSTERR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_SC2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AVGS:2;
      uint64_t AVGE:1;
      uint64_t ADCO:1;
      uint64_t reservedSpace0:3;
      uint64_t CAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_SC3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BA_OFS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_BASE_OFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_OFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USR_OFS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_USR_OFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XOFS:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_XOFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t YOFS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_YOFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_G;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UG:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_UG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLPS:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CLPS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLP3:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CLP3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLP2:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CLP2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLP1:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CLP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLP0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CLP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLPX:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CLPX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLP9:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CLP9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLPS_OFS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CLPS_OFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLP3_OFS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CLP3_OFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLP2_OFS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CLP2_OFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLP1_OFS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CLP1_OFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLP0_OFS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CLP0_OFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLPX_OFS:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CLPX_OFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLP9_OFS:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_CLP9_OFS;

  uint8_t res0[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:6;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_aSC1A;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:6;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_aSC1B;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:6;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_aSC1C;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:6;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_aSC1D;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:6;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_aSC1E;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:6;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_aSC1F;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:6;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_aSC1G;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:6;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_aSC1H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:6;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_aSC1I;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:6;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_aSC1J;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:6;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_aSC1K;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:6;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_aSC1L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:6;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_aSC1M;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:6;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_aSC1N;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:6;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_aSC1O;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:6;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_aSC1P;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:6;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_SC1Q;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:6;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_SC1R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:6;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_SC1S;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:6;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_SC1T;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:6;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_SC1U;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:6;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_SC1V;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:6;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_SC1W;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:6;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_SC1X;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:6;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_SC1Y;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:6;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_SC1Z;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:6;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_SC1AA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:6;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_SC1AB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:6;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_SC1AC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:6;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_SC1AD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:6;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_SC1AE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCH:6;
      uint64_t AIEN:1;
      uint64_t COCO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_SC1AF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_aRA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_aRB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_aRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_aRD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_aRE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_aRF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_aRG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_aRH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_aRI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_aRJ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_aRK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_aRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_aRM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_aRN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_aRO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_aRP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_RQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_RR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_RS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_RT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_RU;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_RV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_RW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_RX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_RY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_RZ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_RAA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_RAB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_RAC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_RAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_RAE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_RAF;

