iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K148_GHS/targetInit/S32K148_sfr.h
};

#define LPSPI2 (*(volatile struct LPSPI2_tag *) 0x4002e000)

struct LPIT0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEATURE:16;
      uint64_t MINOR:8;
      uint64_t MAJOR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPIT0_VERID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL:8;
      uint64_t EXT_TRIG:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPIT0_PARAM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M_CEN:1;
      uint64_t SW_RST:1;
      uint64_t DOZE_EN:1;
      uint64_t DBG_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPIT0_MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF0:1;
      uint64_t TIF1:1;
      uint64_t TIF2:1;
      uint64_t TIF3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPIT0_MSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIE0:1;
      uint64_t TIE1:1;
      uint64_t TIE2:1;
      uint64_t TIE3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPIT0_MIER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET_T_EN_0:1;
      uint64_t SET_T_EN_1:1;
      uint64_t SET_T_EN_2:1;
      uint64_t SET_T_EN_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPIT0_SETTEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR_T_EN_0:1;
      uint64_t CLR_T_EN_1:1;
      uint64_t CLR_T_EN_2:1;
      uint64_t CLR_T_EN_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPIT0_CLRTEN;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TMR_VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPIT0_TVAL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TMR_CUR_VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPIT0_CVAL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T_EN:1;
      uint64_t CHAIN:1;
      uint64_t MODE:2;
      uint64_t reservedSpace0:12;
      uint64_t TSOT:1;
      uint64_t TSOI:1;
      uint64_t TROT:1;
      uint64_t reservedSpace1:4;
      uint64_t TRG_SRC:1;
      uint64_t TRG_SEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPIT0_TCTRL0;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TMR_VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPIT0_TVAL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TMR_CUR_VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPIT0_CVAL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T_EN:1;
      uint64_t CHAIN:1;
      uint64_t MODE:2;
      uint64_t reservedSpace0:12;
      uint64_t TSOT:1;
      uint64_t TSOI:1;
      uint64_t TROT:1;
      uint64_t reservedSpace1:4;
      uint64_t TRG_SRC:1;
      uint64_t TRG_SEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPIT0_TCTRL1;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TMR_VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPIT0_TVAL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TMR_CUR_VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPIT0_CVAL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T_EN:1;
      uint64_t CHAIN:1;
      uint64_t MODE:2;
      uint64_t reservedSpace0:12;
      uint64_t TSOT:1;
      uint64_t TSOI:1;
      uint64_t TROT:1;
      uint64_t reservedSpace1:4;
      uint64_t TRG_SRC:1;
      uint64_t TRG_SEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPIT0_TCTRL2;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TMR_VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPIT0_TVAL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TMR_CUR_VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPIT0_CVAL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T_EN:1;
      uint64_t CHAIN:1;
      uint64_t MODE:2;
      uint64_t reservedSpace0:12;
      uint64_t TSOT:1;
      uint64_t TSOI:1;
      uint64_t TROT:1;
      uint64_t reservedSpace1:4;
      uint64_t TRG_SRC:1;
      uint64_t TRG_SEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPIT0_TCTRL3;

};

#define LPIT0 (*(volatile struct LPIT0_tag *) 0x40037000)

struct RTC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_TSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TPR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_TPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_TAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCR:8;
      uint64_t CIR:8;
      uint64_t TCV:8;
      uint64_t CIC:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_TCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWR:1;
      uint64_t reservedSpace0:1;
      uint64_t SUP:1;
      uint64_t UM:1;
      uint64_t reservedSpace1:1;
      uint64_t CPS:1;
      uint64_t reservedSpace2:1;
      uint64_t LPOS:1;
      uint64_t reservedSpace3:16;
      uint64_t CPE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
      uint64_t TOF:1;
      uint64_t TAF:1;
      uint64_t reservedSpace0:1;
      uint64_t TCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t TCL:1;
      uint64_t CRL:1;
      uint64_t SRL:1;
      uint64_t LRL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_LR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIIE:1;
      uint64_t TOIE:1;
      uint64_t TAIE:1;
      uint64_t reservedSpace0:1;
      uint64_t TSIE:1;
      uint64_t reservedSpace1:11;
      uint64_t TSIC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTC_IER;

