iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K148_GHS/targetInit/S32K148_sfr.h
};

#define RTC (*(volatile struct RTC_tag *) 0x4003d000)

struct LPTMR0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TMS:1;
      uint64_t TFC:1;
      uint64_t TPP:1;
      uint64_t TPS:2;
      uint64_t TIE:1;
      uint64_t TCF:1;
      uint64_t TDRE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPTMR0_CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS:2;
      uint64_t PBYP:1;
      uint64_t PRESCALE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPTMR0_PSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMPARE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPTMR0_CMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNTER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPTMR0_CNR;

};

#define LPTMR0 (*(volatile struct LPTMR0_tag *) 0x40040000)

struct SIM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_INTERLEAVE_EN:4;
      uint64_t CLKOUTSEL:4;
      uint64_t CLKOUTDIV:3;
      uint64_t CLKOUTEN:1;
      uint64_t TRACECLK_SEL:1;
      uint64_t PDB_BB_SEL:1;
      uint64_t reservedSpace0:2;
      uint64_t ADC_SUPPLY:3;
      uint64_t ADC_SUPPLYEN:1;
      uint64_t SRAMU_RETEN:1;
      uint64_t SRAML_RETEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIM_CHIPCTL;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTM0FLTxSEL:3;
      uint64_t reservedSpace0:1;
      uint64_t FTM1FLTxSEL:3;
      uint64_t reservedSpace1:1;
      uint64_t FTM2FLTxSEL:3;
      uint64_t reservedSpace2:1;
      uint64_t FTM3FLTxSEL:3;
      uint64_t reservedSpace3:1;
      uint64_t FTM4CLKSEL:2;
      uint64_t FTM5CLKSEL:2;
      uint64_t FTM6CLKSEL:2;
      uint64_t FTM7CLKSEL:2;
      uint64_t FTM0CLKSEL:2;
      uint64_t FTM1CLKSEL:2;
      uint64_t FTM2CLKSEL:2;
      uint64_t FTM3CLKSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIM_FTMOPT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LPO1KCLKEN:1;
      uint64_t LPO32KCLKEN:1;
      uint64_t LPOCLKSEL:2;
      uint64_t RTCCLKSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIM_LPOCLKS;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC0TRGSEL:1;
      uint64_t ADC0SWPRETRG:3;
      uint64_t ADC0PRETRGSEL:2;
      uint64_t reservedSpace0:2;
      uint64_t ADC1TRGSEL:1;
      uint64_t ADC1SWPRETRG:3;
      uint64_t ADC1PRETRGSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIM_ADCOPT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTM0SYNCBIT:1;
      uint64_t FTM1SYNCBIT:1;
      uint64_t FTM2SYNCBIT:1;
      uint64_t FTM3SYNCBIT:1;
      uint64_t FTM1CH0SEL:2;
      uint64_t FTM2CH0SEL:2;
      uint64_t FTM2CH1SEL:1;
      uint64_t reservedSpace0:2;
      uint64_t FTM4SYNCBIT:1;
      uint64_t FTM5SYNCBIT:1;
      uint64_t FTM6SYNCBIT:1;
      uint64_t FTM7SYNCBIT:1;
      uint64_t FTMGLDOK:1;
      uint64_t FTM0_OUTSEL:8;
      uint64_t FTM3_OUTSEL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIM_FTMOPT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:14;
      uint64_t FTM_GTB_SPLIT_EN:1;
      uint64_t reservedSpace1:1;
      uint64_t FTM0_OBE_CTRL:1;
      uint64_t FTM1_OBE_CTRL:1;
      uint64_t FTM2_OBE_CTRL:1;
      uint64_t FTM3_OBE_CTRL:1;
      uint64_t FTM4_OBE_CTRL:1;
      uint64_t FTM5_OBE_CTRL:1;
      uint64_t FTM6_OBE_CTRL:1;
      uint64_t FTM7_OBE_CTRL:1;
      uint64_t RMII_CLK_OBE:1;
      uint64_t RMII_CLK_SEL:1;
      uint64_t QSPI_CLK_SEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIM_MISCTRL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEATURES:8;
      uint64_t PACKAGE:4;
      uint64_t REVID:4;
      uint64_t RAMSIZE:4;
      uint64_t DERIVATE:4;
      uint64_t SUBSERIES:4;
      uint64_t GENERATION:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIM_SDID;

  uint8_t res2[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CGCMSCM:1;
      uint64_t CGCMPU:1;
      uint64_t CGCDMA:1;
      uint64_t CGCERM:1;
      uint64_t CGCEIM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIM_PLATCGC;

  uint8_t res3[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:12;
      uint64_t DEPART:4;
      uint64_t EEERAMSIZE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIM_FCFG1;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UID127_96:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIM_UIDH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UID95_64:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIM_UIDMH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UID63_32:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIM_UIDML;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UID31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIM_UIDL;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRACEFRAC:1;
      uint64_t TRACEDIV:3;
      uint64_t reservedSpace0:24;
      uint64_t TRACEDIVEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIM_CLKDIV4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SW_TRG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIM_MISCTRL1;

};

#define SIM (*(volatile struct SIM_tag *) 0x40048004)

struct PORTA_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:2;
      uint64_t PFE:1;
      uint64_t reservedSpace1:3;
      uint64_t MUX:3;
      uint64_t reservedSpace2:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace3:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:1;
      uint64_t PE:1;
      uint64_t reservedSpace0:6;
      uint64_t MUX:3;
      uint64_t reservedSpace1:4;
      uint64_t LK:1;
      uint64_t IRQC:4;
      uint64_t reservedSpace2:4;
      uint64_t ISF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_PCR31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPWD:16;
      uint64_t GPWE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_GPCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPWD:16;
      uint64_t GPWE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_GPCHR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIWE:16;
      uint64_t GIWD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_GICLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIWE:16;
      uint64_t GIWD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_GICHR;

  uint8_t res0[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_ISFR;

  uint8_t res1[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DFE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_DFER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_DFCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FILT:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORTA_DFWR;

