iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K148_GHS/targetInit/S32K148_sfr.h
};

#define PORTE (*(volatile struct PORTE_tag *) 0x4004d000)

struct WDOG_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t STOP:1;
      uint64_t WAIT:1;
      uint64_t DBG:1;
      uint64_t TST:2;
      uint64_t UPDATE:1;
      uint64_t INT:1;
      uint64_t EN:1;
      uint64_t CLK:2;
      uint64_t RCS:1;
      uint64_t ULK:1;
      uint64_t PRES:1;
      uint64_t CMD32EN:1;
      uint64_t FLG:1;
      uint64_t WIN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDOG_CS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNTLOW:8;
      uint64_t CNTHIGH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDOG_CNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TOVALLOW:8;
      uint64_t TOVALHIGH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDOG_TOVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WINLOW:8;
      uint64_t WINHIGH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDOG_WIN;

};

#define WDOG (*(volatile struct WDOG_tag *) 0x40052000)

struct SAI0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEATURE:16;
      uint64_t MINOR:8;
      uint64_t MAJOR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAI_VERID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATALINE:4;
      uint64_t reservedSpace0:4;
      uint64_t FIFO:4;
      uint64_t reservedSpace1:4;
      uint64_t FRAME:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAI_PARAM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRDE:1;
      uint64_t FWDE:1;
      uint64_t reservedSpace0:6;
      uint64_t FRIE:1;
      uint64_t FWIE:1;
      uint64_t FEIE:1;
      uint64_t SEIE:1;
      uint64_t WSIE:1;
      uint64_t reservedSpace1:3;
      uint64_t FRF:1;
      uint64_t FWF:1;
      uint64_t FEF:1;
      uint64_t SEF:1;
      uint64_t WSF:1;
      uint64_t reservedSpace2:3;
      uint64_t SR:1;
      uint64_t FR:1;
      uint64_t reservedSpace3:2;
      uint64_t BCE:1;
      uint64_t DBGE:1;
      uint64_t reservedSpace4:1;
      uint64_t TE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAI_TCSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFW:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAI_TCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:16;
      uint64_t BCD:1;
      uint64_t BCP:1;
      uint64_t MSEL:2;
      uint64_t BCI:1;
      uint64_t BCS:1;
      uint64_t SYNC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAI_TCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDFL:4;
      uint64_t reservedSpace0:12;
      uint64_t TCE:4;
      uint64_t reservedSpace1:4;
      uint64_t CFR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAI_TCR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSD:1;
      uint64_t FSP:1;
      uint64_t ONDEM:1;
      uint64_t FSE:1;
      uint64_t MF:1;
      uint64_t CHMOD:1;
      uint64_t reservedSpace0:2;
      uint64_t SYWD:5;
      uint64_t reservedSpace1:3;
      uint64_t FRSZ:4;
      uint64_t reservedSpace2:4;
      uint64_t FPACK:2;
      uint64_t FCOMB:2;
      uint64_t FCONT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAI_TCR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t FBT:5;
      uint64_t reservedSpace1:3;
      uint64_t W0W:5;
      uint64_t reservedSpace2:3;
      uint64_t WNW:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAI_TCR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAI_TDR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAI_TDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAI_TDR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAI_TDR3;

  uint8_t res0[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFP:4;
      uint64_t reservedSpace0:12;
      uint64_t WFP:4;
      uint64_t reservedSpace1:11;
      uint64_t WCP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAI_TFR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFP:4;
      uint64_t reservedSpace0:12;
      uint64_t WFP:4;
      uint64_t reservedSpace1:11;
      uint64_t WCP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAI_TFR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFP:4;
      uint64_t reservedSpace0:12;
      uint64_t WFP:4;
      uint64_t reservedSpace1:11;
      uint64_t WCP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAI_TFR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFP:4;
      uint64_t reservedSpace0:12;
      uint64_t WFP:4;
      uint64_t reservedSpace1:11;
      uint64_t WCP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAI_TFR3;

  uint8_t res1[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TWM:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAI_TMR;

  uint8_t res2[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRDE:1;
      uint64_t FWDE:1;
      uint64_t reservedSpace0:6;
      uint64_t FRIE:1;
      uint64_t FWIE:1;
      uint64_t FEIE:1;
      uint64_t SEIE:1;
      uint64_t WSIE:1;
      uint64_t reservedSpace1:3;
      uint64_t FRF:1;
      uint64_t FWF:1;
      uint64_t FEF:1;
      uint64_t SEF:1;
      uint64_t WSF:1;
      uint64_t reservedSpace2:3;
      uint64_t SR:1;
      uint64_t FR:1;
      uint64_t reservedSpace3:2;
      uint64_t BCE:1;
      uint64_t DBGE:1;
      uint64_t reservedSpace4:1;
      uint64_t RE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAI_RCSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFW:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAI_RCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:16;
      uint64_t BCD:1;
      uint64_t BCP:1;
      uint64_t MSEL:2;
      uint64_t BCI:1;
      uint64_t BCS:1;
      uint64_t SYNC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAI_RCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDFL:4;
      uint64_t reservedSpace0:12;
      uint64_t RCE:4;
      uint64_t reservedSpace1:4;
      uint64_t CFR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAI_RCR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSD:1;
      uint64_t FSP:1;
      uint64_t ONDEM:1;
      uint64_t FSE:1;
      uint64_t MF:1;
      uint64_t reservedSpace0:3;
      uint64_t SYWD:5;
      uint64_t reservedSpace1:3;
      uint64_t FRSZ:4;
      uint64_t reservedSpace2:4;
      uint64_t FPACK:2;
      uint64_t FCOMB:2;
      uint64_t FCONT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAI_RCR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t FBT:5;
      uint64_t reservedSpace1:3;
      uint64_t W0W:5;
      uint64_t reservedSpace2:3;
      uint64_t WNW:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAI_RCR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAI_RDR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAI_RDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAI_RDR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAI_RDR3;

  uint8_t res3[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFP:4;
      uint64_t reservedSpace0:11;
      uint64_t RCP:1;
      uint64_t WFP:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAI_RFR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFP:4;
      uint64_t reservedSpace0:11;
      uint64_t RCP:1;
      uint64_t WFP:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAI_RFR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFP:4;
      uint64_t reservedSpace0:11;
      uint64_t RCP:1;
      uint64_t WFP:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAI_RFR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFP:4;
      uint64_t reservedSpace0:11;
      uint64_t RCP:1;
      uint64_t WFP:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAI_RFR3;

  uint8_t res4[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RWM:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAI_RMR;

