iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K148_GHS/targetInit/S32K148_sfr.h
  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:24;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGMUX_CMP0;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:1;
      uint64_t SEL3:7;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGMUX_FTM0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:1;
      uint64_t SEL3:7;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGMUX_FTM1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:1;
      uint64_t SEL3:7;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGMUX_FTM2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:1;
      uint64_t SEL3:7;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGMUX_FTM3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:24;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGMUX_PDB0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:24;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGMUX_PDB1;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:1;
      uint64_t SEL3:7;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGMUX_FLEXIO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:1;
      uint64_t SEL3:7;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGMUX_LPIT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:24;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGMUX_LPUART0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:24;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGMUX_LPUART1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:24;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGMUX_LPI2C0;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:24;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGMUX_LPSPI0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:24;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGMUX_LPSPI1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:24;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGMUX_LPTMR0;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:24;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGMUX_LPI2C1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:24;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGMUX_FTM4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:24;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGMUX_FTM5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:24;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGMUX_FTM6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:24;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGMUX_FTM7;

};

#define TRGMUX (*(volatile struct TRGMUX_tag *) 0x40063000)

struct SCG_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t VERSION:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCG_VERID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLKPRES:8;
      uint64_t reservedSpace0:19;
      uint64_t DIVPRES:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCG_PARAM;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVSLOW:4;
      uint64_t DIVBUS:4;
      uint64_t reservedSpace0:8;
      uint64_t DIVCORE:4;
      uint64_t reservedSpace1:4;
      uint64_t SCS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCG_CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVSLOW:4;
      uint64_t DIVBUS:4;
      uint64_t reservedSpace0:8;
      uint64_t DIVCORE:4;
      uint64_t reservedSpace1:4;
      uint64_t SCS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCG_RCCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVSLOW:4;
      uint64_t DIVBUS:4;
      uint64_t reservedSpace0:8;
      uint64_t DIVCORE:4;
      uint64_t reservedSpace1:4;
      uint64_t SCS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCG_VCCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVSLOW:4;
      uint64_t DIVBUS:4;
      uint64_t reservedSpace0:8;
      uint64_t DIVCORE:4;
      uint64_t reservedSpace1:4;
      uint64_t SCS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCG_HCCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t CLKOUTSEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCG_CLKOUTCNFG;

  uint8_t res1[220];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SOSCEN:1;
      uint64_t reservedSpace0:15;
      uint64_t SOSCCM:1;
      uint64_t SOSCCMRE:1;
      uint64_t reservedSpace1:5;
      uint64_t LK:1;
      uint64_t SOSCVLD:1;
      uint64_t SOSCSEL:1;
      uint64_t SOSCERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCG_SOSCCSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SOSCDIV1:3;
      uint64_t reservedSpace0:5;
      uint64_t SOSCDIV2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCG_SOSCDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t EREFS:1;
      uint64_t HGO:1;
      uint64_t RANGE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCG_SOSCCFG;

  uint8_t res2[244];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIRCEN:1;
      uint64_t SIRCSTEN:1;
      uint64_t SIRCLPEN:1;
      uint64_t reservedSpace0:20;
      uint64_t LK:1;
      uint64_t SIRCVLD:1;
      uint64_t SIRCSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCG_SIRCCSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIRCDIV1:3;
      uint64_t reservedSpace0:5;
      uint64_t SIRCDIV2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCG_SIRCDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RANGE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCG_SIRCCFG;

  uint8_t res3[244];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FIRCEN:1;
      uint64_t reservedSpace0:2;
      uint64_t FIRCREGOFF:1;
      uint64_t reservedSpace1:19;
      uint64_t LK:1;
      uint64_t FIRCVLD:1;
      uint64_t FIRCSEL:1;
      uint64_t FIRCERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCG_FIRCCSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FIRCDIV1:3;
      uint64_t reservedSpace0:5;
      uint64_t FIRCDIV2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCG_FIRCDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RANGE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCG_FIRCCFG;

  uint8_t res4[756];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPLLEN:1;
      uint64_t reservedSpace0:15;
      uint64_t SPLLCM:1;
      uint64_t SPLLCMRE:1;
      uint64_t reservedSpace1:5;
      uint64_t LK:1;
      uint64_t SPLLVLD:1;
      uint64_t SPLLSEL:1;
      uint64_t SPLLERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCG_SPLLCSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPLLDIV1:3;
      uint64_t reservedSpace0:5;
      uint64_t SPLLDIV2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCG_SPLLDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t PREDIV:3;
      uint64_t reservedSpace1:5;
      uint64_t MULT:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCG_SPLLCFG;

