iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K148_GHS/targetInit/S32K148_sfr.h
};

#define SCG (*(volatile struct SCG_tag *) 0x40064000)

struct PCC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:30;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_FTFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:30;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_DMAMUX;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:30;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_FlexCAN0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:30;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_FlexCAN1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PCS:3;
      uint64_t reservedSpace1:3;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_FTM3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PCS:3;
      uint64_t reservedSpace1:3;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_ADC1;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:30;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_FlexCAN2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PCS:3;
      uint64_t reservedSpace1:3;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_LPSPI0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PCS:3;
      uint64_t reservedSpace1:3;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_LPSPI1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PCS:3;
      uint64_t reservedSpace1:3;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_LPSPI2;

  uint8_t res2[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:30;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_PDB1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:30;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_CRC;

  uint8_t res3[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:30;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_PDB0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PCS:3;
      uint64_t reservedSpace1:3;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_LPIT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PCS:3;
      uint64_t reservedSpace1:3;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_FTM0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PCS:3;
      uint64_t reservedSpace1:3;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_FTM1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PCS:3;
      uint64_t reservedSpace1:3;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_FTM2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PCS:3;
      uint64_t reservedSpace1:3;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_ADC0;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:30;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_RTC;

  uint8_t res5[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCD:3;
      uint64_t FRAC:1;
      uint64_t reservedSpace0:20;
      uint64_t PCS:3;
      uint64_t reservedSpace1:3;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_LPTMR0;

  uint8_t res6[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:30;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_PORTA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:30;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_PORTB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:30;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_PORTC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:30;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_PORTD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:30;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_PORTE;

  uint8_t res7[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:30;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_SAI0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:30;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_SAI1;

  uint8_t res8[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PCS:3;
      uint64_t reservedSpace1:3;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_FlexIO;

  uint8_t res9[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:30;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_EWM;

  uint8_t res10[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PCS:3;
      uint64_t reservedSpace1:3;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_LPI2C0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PCS:3;
      uint64_t reservedSpace1:3;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_LPI2C1;

  uint8_t res11[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PCS:3;
      uint64_t reservedSpace1:3;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_LPUART0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PCS:3;
      uint64_t reservedSpace1:3;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_LPUART1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PCS:3;
      uint64_t reservedSpace1:3;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_LPUART2;

  uint8_t res12[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PCS:3;
      uint64_t reservedSpace1:3;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_FTM4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PCS:3;
      uint64_t reservedSpace1:3;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_FTM5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PCS:3;
      uint64_t reservedSpace1:3;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_FTM6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PCS:3;
      uint64_t reservedSpace1:3;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_FTM7;

  uint8_t res13[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:30;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_CMP0;

  uint8_t res14[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:30;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_QSPI;

  uint8_t res15[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCD:3;
      uint64_t FRAC:1;
      uint64_t reservedSpace0:20;
      uint64_t PCS:3;
      uint64_t reservedSpace1:3;
      uint64_t CGC:1;
      uint64_t PR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCC_ENET;

