iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K148_GHS/targetInit/S32K148_sfr.h
};

#define LPUART2 (*(volatile struct LPUART2_tag *) 0x4006c000)

struct CMP0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t HYSTCTR:2;
      uint64_t OFFSET:1;
      uint64_t reservedSpace0:1;
      uint64_t FILTER_CNT:3;
      uint64_t reservedSpace1:1;
      uint64_t EN:1;
      uint64_t OPE:1;
      uint64_t COS:1;
      uint64_t INVT:1;
      uint64_t PMODE:1;
      uint64_t reservedSpace2:1;
      uint64_t WE:1;
      uint64_t SE:1;
      uint64_t FPR:8;
      uint64_t COUT:1;
      uint64_t CFF:1;
      uint64_t CFR:1;
      uint64_t IEF:1;
      uint64_t IER:1;
      uint64_t reservedSpace3:1;
      uint64_t DMAEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMP0_C0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VOSEL:8;
      uint64_t MSEL:3;
      uint64_t PSEL:3;
      uint64_t VRSEL:1;
      uint64_t DACEN:1;
      uint64_t CHN0:1;
      uint64_t CHN1:1;
      uint64_t CHN2:1;
      uint64_t CHN3:1;
      uint64_t CHN4:1;
      uint64_t CHN5:1;
      uint64_t CHN6:1;
      uint64_t CHN7:1;
      uint64_t INNSEL:2;
      uint64_t reservedSpace0:1;
      uint64_t INPSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMP0_C1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACOn:8;
      uint64_t INITMOD:6;
      uint64_t NSAM:2;
      uint64_t CH0F:1;
      uint64_t CH1F:1;
      uint64_t CH2F:1;
      uint64_t CH3F:1;
      uint64_t CH4F:1;
      uint64_t CH5F:1;
      uint64_t CH6F:1;
      uint64_t CH7F:1;
      uint64_t reservedSpace0:1;
      uint64_t FXMXCH:3;
      uint64_t reservedSpace1:1;
      uint64_t FXMP:1;
      uint64_t RRIE:1;
      uint64_t RRE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMP0_C2;

};

#define CMP0 (*(volatile struct CMP0_tag *) 0x40073000)

struct QuadSPI_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWRSTSD:1;
      uint64_t SWRSTHD:1;
      uint64_t END_CFG:2;
      uint64_t DQS_OUT_EN:1;
      uint64_t DQS_LAT_EN:1;
      uint64_t DQS_EN:1;
      uint64_t DDR_EN:1;
      uint64_t VAR_LAT_EN:1;
      uint64_t reservedSpace0:1;
      uint64_t CLR_RXF:1;
      uint64_t CLR_TXF:1;
      uint64_t reservedSpace1:2;
      uint64_t MDIS:1;
      uint64_t DOZE:1;
      uint64_t ISD2FA:1;
      uint64_t ISD3FA:1;
      uint64_t ISD2FB:1;
      uint64_t ISD3FB:1;
      uint64_t reservedSpace2:4;
      uint64_t SCLKCFG:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_MCR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDATSZ:16;
      uint64_t reservedSpace0:8;
      uint64_t SEQID:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_IPCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCSS:4;
      uint64_t reservedSpace0:4;
      uint64_t TCSH:4;
      uint64_t reservedSpace1:4;
      uint64_t TDH:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_FLSHCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTRID:4;
      uint64_t reservedSpace0:4;
      uint64_t ADATSZ:8;
      uint64_t reservedSpace1:15;
      uint64_t HP_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_BUF0CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTRID:4;
      uint64_t reservedSpace0:4;
      uint64_t ADATSZ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_BUF1CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTRID:4;
      uint64_t reservedSpace0:4;
      uint64_t ADATSZ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_BUF2CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTRID:4;
      uint64_t reservedSpace0:4;
      uint64_t ADATSZ:8;
      uint64_t reservedSpace1:15;
      uint64_t ALLMST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_BUF3CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:12;
      uint64_t SEQID:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_BFGENCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SOCCFG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_SOCCR;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t TPINDX0:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_BUF0IND;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t TPINDX1:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_BUF1IND;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t TPINDX2:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_BUF2IND;

  uint8_t res2[196];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SFADR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_SFAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAS:4;
      uint64_t reservedSpace0:12;
      uint64_t WA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_SFACR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t FSPHS:1;
      uint64_t FSDLY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_SMPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t RDBFL:6;
      uint64_t reservedSpace1:2;
      uint64_t RDCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_RBSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WMRK:5;
      uint64_t reservedSpace0:3;
      uint64_t RXBRD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_RBCT;

  uint8_t res3[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t TRBFL:6;
      uint64_t reservedSpace1:2;
      uint64_t TRCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_TBSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_TBDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WMRK:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_TBCT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUSY:1;
      uint64_t IP_ACC:1;
      uint64_t AHB_ACC:1;
      uint64_t reservedSpace0:2;
      uint64_t AHBGNT:1;
      uint64_t AHBTRN:1;
      uint64_t AHB0NE:1;
      uint64_t AHB1NE:1;
      uint64_t AHB2NE:1;
      uint64_t AHB3NE:1;
      uint64_t AHB0FUL:1;
      uint64_t AHB1FUL:1;
      uint64_t AHB2FUL:1;
      uint64_t AHB3FUL:1;
      uint64_t reservedSpace1:1;
      uint64_t RXWE:1;
      uint64_t reservedSpace2:2;
      uint64_t RXFULL:1;
      uint64_t reservedSpace3:3;
      uint64_t RXDMA:1;
      uint64_t TXEDA:1;
      uint64_t TXWA:1;
      uint64_t TXDMA:1;
      uint64_t TXFULL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFF:1;
      uint64_t reservedSpace0:3;
      uint64_t IPGEF:1;
      uint64_t reservedSpace1:1;
      uint64_t IPIEF:1;
      uint64_t IPAEF:1;
      uint64_t reservedSpace2:4;
      uint64_t ABOF:1;
      uint64_t AIBSEF:1;
      uint64_t AITEF:1;
      uint64_t ABSEF:1;
      uint64_t RBDF:1;
      uint64_t RBOF:1;
      uint64_t reservedSpace3:5;
      uint64_t ILLINE:1;
      uint64_t reservedSpace4:2;
      uint64_t TBUF:1;
      uint64_t TBFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_FR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFIE:1;
      uint64_t reservedSpace0:3;
      uint64_t IPGEIE:1;
      uint64_t reservedSpace1:1;
      uint64_t IPIEIE:1;
      uint64_t IPAEIE:1;
      uint64_t reservedSpace2:4;
      uint64_t ABOIE:1;
      uint64_t AIBSIE:1;
      uint64_t AITIE:1;
      uint64_t ABSEIE:1;
      uint64_t RBDIE:1;
      uint64_t RBOIE:1;
      uint64_t reservedSpace3:3;
      uint64_t RBDDE:1;
      uint64_t reservedSpace4:1;
      uint64_t ILLINIE:1;
      uint64_t reservedSpace5:1;
      uint64_t TBFDE:1;
      uint64_t TBUIE:1;
      uint64_t TBFIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_RSER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SUSPND:1;
      uint64_t reservedSpace0:5;
      uint64_t SPDBUF:2;
      uint64_t reservedSpace1:1;
      uint64_t DATLFT:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_SPNDST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BFPTRC:1;
      uint64_t reservedSpace0:7;
      uint64_t IPPTRC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_SPTRCLR;

  uint8_t res4[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:10;
      uint64_t TPADA1:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_SFA1AD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:10;
      uint64_t TPADA2:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_SFA2AD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:10;
      uint64_t TPADB1:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_SFB1AD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:10;
      uint64_t TPADB2:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_SFB2AD;

  uint8_t res5[112];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_RBDR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_RBDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_RBDR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_RBDR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_RBDR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_RBDR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_RBDR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_RBDR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_RBDR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_RBDR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_RBDR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_RBDR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_RBDR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_RBDR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_RBDR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_RBDR15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_RBDR16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_RBDR17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_RBDR18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_RBDR19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_RBDR20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_RBDR21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_RBDR22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_RBDR23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_RBDR24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_RBDR25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_RBDR26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_RBDR27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_RBDR28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_RBDR29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_RBDR30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QuadSPI_RBDR31;

