iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K148_GHS/targetInit/S32K148_sfr.h
};

#define QuadSPI (*(volatile struct QuadSPI_tag *) 0x40076000)

struct ENET_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:15;
      uint64_t TS_TIMER:1;
      uint64_t TS_AVAIL:1;
      uint64_t WAKEUP:1;
      uint64_t PLR:1;
      uint64_t UN:1;
      uint64_t RL:1;
      uint64_t LC:1;
      uint64_t EBERR:1;
      uint64_t MII:1;
      uint64_t RXB:1;
      uint64_t RXF:1;
      uint64_t TXB:1;
      uint64_t TXF:1;
      uint64_t GRA:1;
      uint64_t BABT:1;
      uint64_t BABR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_EIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:15;
      uint64_t TS_TIMER:1;
      uint64_t TS_AVAIL:1;
      uint64_t WAKEUP:1;
      uint64_t PLR:1;
      uint64_t UN:1;
      uint64_t RL:1;
      uint64_t LC:1;
      uint64_t EBERR:1;
      uint64_t MII:1;
      uint64_t RXB:1;
      uint64_t RXF:1;
      uint64_t TXB:1;
      uint64_t TXF:1;
      uint64_t GRA:1;
      uint64_t BABT:1;
      uint64_t BABR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_EIMR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t RDAR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RDAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t TDAR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_TDAR;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESET:1;
      uint64_t ETHEREN:1;
      uint64_t MAGICEN:1;
      uint64_t SLEEP:1;
      uint64_t EN1588:1;
      uint64_t reservedSpace0:1;
      uint64_t DBGEN:1;
      uint64_t reservedSpace1:1;
      uint64_t DBSWP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_ECR;

  uint8_t res2[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:16;
      uint64_t TA:2;
      uint64_t RA:5;
      uint64_t PA:5;
      uint64_t OP:2;
      uint64_t ST:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_MMFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t MII_SPEED:6;
      uint64_t DIS_PRE:1;
      uint64_t HOLDTIME:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_MSCR;

  uint8_t res3[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:29;
      uint64_t MIB_CLEAR:1;
      uint64_t MIB_IDLE:1;
      uint64_t MIB_DIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_MIBC;

  uint8_t res4[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOOP:1;
      uint64_t DRT:1;
      uint64_t MII_MODE:1;
      uint64_t PROM:1;
      uint64_t BC_REJ:1;
      uint64_t FCE:1;
      uint64_t reservedSpace0:2;
      uint64_t RMII_MODE:1;
      uint64_t RMII_10T:1;
      uint64_t reservedSpace1:2;
      uint64_t PADEN:1;
      uint64_t PAUFWD:1;
      uint64_t CRCFWD:1;
      uint64_t CFEN:1;
      uint64_t MAX_FL:14;
      uint64_t NLC:1;
      uint64_t GRS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RCR;

  uint8_t res5[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GTS:1;
      uint64_t reservedSpace0:1;
      uint64_t FDEN:1;
      uint64_t TFC_PAUSE:1;
      uint64_t RFC_PAUSE:1;
      uint64_t ADDSEL:3;
      uint64_t ADDINS:1;
      uint64_t CRCFWD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_TCR;

  uint8_t res6[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADDR1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_PALR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TYPE:16;
      uint64_t PADDR2:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_PAUR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAUSE_DUR:16;
      uint64_t OPCODE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_OPD;

  uint8_t res7[40];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IADDR1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_IAUR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IADDR2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_IALR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GADDR1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_GAUR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GADDR2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_GALR;

  uint8_t res8[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFWR:6;
      uint64_t reservedSpace0:2;
      uint64_t STRFWD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_TFWR;

  uint8_t res9[56];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t R_DES_START:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RDSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t X_DES_START:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_TDSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t R_BUF_SIZE:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_MRBR;

  uint8_t res10[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_SECTION_FULL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RSFL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_SECTION_EMPTY:8;
      uint64_t reservedSpace0:8;
      uint64_t STAT_SECTION_EMPTY:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RSEM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_ALMOST_EMPTY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RAEM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_ALMOST_FULL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RAFL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_SECTION_EMPTY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_TSEM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_ALMOST_EMPTY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_TAEM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_ALMOST_FULL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_TAFL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IPG:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_TIPG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRUNC_FL:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_FTRL;

  uint8_t res11[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFT16:1;
      uint64_t reservedSpace0:2;
      uint64_t IPCHK:1;
      uint64_t PROCHK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_TACC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADREM:1;
      uint64_t IPDIS:1;
      uint64_t PRODIS:1;
      uint64_t reservedSpace0:3;
      uint64_t LINEDIS:1;
      uint64_t SHIFT16:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RACC;

  uint8_t res12[56];

  uint32_t ENET_RMON_T_DROP;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPKTS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_T_PACKETS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPKTS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_T_BC_PKT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPKTS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_T_MC_PKT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPKTS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_T_CRC_ALIGN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPKTS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_T_UNDERSIZE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPKTS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_T_OVERSIZE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPKTS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_T_FRAG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPKTS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_T_JAB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPKTS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_T_COL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPKTS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_T_P64;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPKTS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_T_P65TO127;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPKTS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_T_P128TO255;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPKTS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_T_P256TO511;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPKTS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_T_P512TO1023;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPKTS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_T_P1024TO2047;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPKTS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_T_P_GTE2048;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXOCTS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_T_OCTETS;

  uint32_t ENET_IEEE_T_DROP;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_IEEE_T_FRAME_OK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_IEEE_T_1COL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_IEEE_T_MCOL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_IEEE_T_DEF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_IEEE_T_LCOL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_IEEE_T_EXCOL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_IEEE_T_MACERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_IEEE_T_CSERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_IEEE_T_SQE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_IEEE_T_FDXFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_IEEE_T_OCTETS_OK;

  uint8_t res13[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_R_PACKETS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_R_BC_PKT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_R_MC_PKT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_R_CRC_ALIGN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_R_UNDERSIZE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_R_OVERSIZE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_R_FRAG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_R_JAB;

  uint32_t ENET_RMON_R_RESVD_0;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_R_P64;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_R_P65TO127;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_R_P128TO255;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_R_P256TO511;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_R_P512TO1023;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_R_P1024TO2047;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_R_P_GTE2048;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_RMON_R_OCTETS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_IEEE_R_DROP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_IEEE_R_FRAME_OK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_IEEE_R_CRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_IEEE_R_ALIGN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_IEEE_R_MACERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_IEEE_R_FDXFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_IEEE_R_OCTETS_OK;

  uint8_t res14[284];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:1;
      uint64_t OFFEN:1;
      uint64_t OFFRST:1;
      uint64_t PEREN:1;
      uint64_t reservedSpace1:2;
      uint64_t PINPER:1;
      uint64_t reservedSpace2:1;
      uint64_t RESTART:1;
      uint64_t reservedSpace3:1;
      uint64_t CAPTURE:1;
      uint64_t reservedSpace4:1;
      uint64_t SLAVE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_ATCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ATIME:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_ATVR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFFSET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_ATOFF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIOD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_ATPER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COR:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_ATCOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INC:7;
      uint64_t reservedSpace0:1;
      uint64_t INC_CORR:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_ATINC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMESTAMP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_ATSTMP;

  uint8_t res15[488];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TF0:1;
      uint64_t TF1:1;
      uint64_t TF2:1;
      uint64_t TF3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_TGSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDRE:1;
      uint64_t reservedSpace0:1;
      uint64_t TMODE:4;
      uint64_t TIE:1;
      uint64_t TF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_TCSR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_TCCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDRE:1;
      uint64_t reservedSpace0:1;
      uint64_t TMODE:4;
      uint64_t TIE:1;
      uint64_t TF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_TCSR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_TCCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDRE:1;
      uint64_t reservedSpace0:1;
      uint64_t TMODE:4;
      uint64_t TIE:1;
      uint64_t TF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_TCSR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_TCCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDRE:1;
      uint64_t reservedSpace0:1;
      uint64_t TMODE:4;
      uint64_t TIE:1;
      uint64_t TF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_TCSR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENET_TCCR3;

