iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K148_GHS/targetInit/S32K148_sfr.h
};

#define ENET (*(volatile struct ENET_tag *) 0x40079004)

struct PMC_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t LVDRE:1;
      uint64_t LVDIE:1;
      uint64_t LVDACK:1;
      uint64_t LVDF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PMC_LVDSC1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t LVWIE:1;
      uint64_t LVWACK:1;
      uint64_t LVWF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PMC_LVDSC2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t BIASEN:1;
      uint64_t CLKBIASDIS:1;
      uint64_t REGFPM:1;
      uint64_t reservedSpace0:3;
      uint64_t LPOSTAT:1;
      uint64_t LPODIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PMC_REGSC;

  uint8_t res0[1];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t LPOTRIM:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PMC_LPOTRIM;

};

#define PMC (*(volatile struct PMC_tag *) 0x4007d000)

struct SMC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEATURE:16;
      uint64_t MINOR:8;
      uint64_t MAJOR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMC_VERID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EHSRUN:1;
      uint64_t reservedSpace0:2;
      uint64_t ELLS:1;
      uint64_t reservedSpace1:1;
      uint64_t ELLS2:1;
      uint64_t EVLLS0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMC_PARAM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t AVLP:1;
      uint64_t reservedSpace1:1;
      uint64_t AHSRUN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMC_PMPROT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STOPM:3;
      uint64_t VLPSA:1;
      uint64_t reservedSpace0:1;
      uint64_t RUNM:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMC_PMCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:6;
      uint64_t STOPO:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMC_STOPCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PMSTAT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMC_PMSTAT;

};

#define SMC (*(volatile struct SMC_tag *) 0x4007e000)

struct RCM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEATURE:16;
      uint64_t MINOR:8;
      uint64_t MAJOR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCM_VERID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EWAKEUP:1;
      uint64_t ELVD:1;
      uint64_t ELOC:1;
      uint64_t ELOL:1;
      uint64_t reservedSpace0:1;
      uint64_t EWDOG:1;
      uint64_t EPIN:1;
      uint64_t EPOR:1;
      uint64_t EJTAG:1;
      uint64_t ELOCKUP:1;
      uint64_t ESW:1;
      uint64_t EMDM_AP:1;
      uint64_t reservedSpace1:1;
      uint64_t ESACKERR:1;
      uint64_t reservedSpace2:1;
      uint64_t ETAMPER:1;
      uint64_t ECORE1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCM_PARAM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t LVD:1;
      uint64_t LOC:1;
      uint64_t LOL:1;
      uint64_t reservedSpace1:1;
      uint64_t WDOG_bitfield:1;
      uint64_t PIN:1;
      uint64_t POR:1;
      uint64_t JTAG:1;
      uint64_t LOCKUP:1;
      uint64_t SW:1;
      uint64_t MDM_AP:1;
      uint64_t reservedSpace2:1;
      uint64_t SACKERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCM_SRS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSTFLTSRW:2;
      uint64_t RSTFLTSS:1;
      uint64_t reservedSpace0:5;
      uint64_t RSTFLTSEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCM_RPC;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t SLVD:1;
      uint64_t SLOC:1;
      uint64_t SLOL:1;
      uint64_t reservedSpace1:1;
      uint64_t SWDOG:1;
      uint64_t SPIN:1;
      uint64_t SPOR:1;
      uint64_t SJTAG:1;
      uint64_t SLOCKUP:1;
      uint64_t SSW:1;
      uint64_t SMDM_AP:1;
      uint64_t reservedSpace2:1;
      uint64_t SSACKERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCM_SSRS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DELAY:2;
      uint64_t LOC:1;
      uint64_t LOL:1;
      uint64_t reservedSpace0:1;
      uint64_t WDOG_bitfield:1;
      uint64_t PIN:1;
      uint64_t GIE:1;
      uint64_t JTAG:1;
      uint64_t LOCKUP:1;
      uint64_t SW:1;
      uint64_t MDM_AP:1;
      uint64_t reservedSpace1:1;
      uint64_t SACKERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCM_SRIE;

};

#define RCM (*(volatile struct RCM_tag *) 0x4007f000)

struct PTA_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOA_PDOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTSO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOA_PSOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTCO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOA_PCOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTTO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOA_PTOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOA_PDIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOA_PDDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOA_PIDR;

};

#define PTA (*(volatile struct PTA_tag *) 0x400ff000)

struct PTB_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOB_PDOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTSO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOB_PSOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTCO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOB_PCOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTTO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOB_PTOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOB_PDIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOB_PDDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOB_PIDR;

