iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K148_GHS/targetInit/S32K148_sfr.h
};

#define S32_NVIC (*(volatile struct S32_NVIC_tag *) 0xe000e100)

struct MCM_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t ASC:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) MCM_PLASC;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t AMC:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) MCM_PLAMC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HLT_FSM_ST:2;
      uint64_t AXBS_HLT_REQ:1;
      uint64_t AXBS_HLTD:1;
      uint64_t FMC_PF_IDLE:1;
      uint64_t reservedSpace0:1;
      uint64_t PBRIDGE_IDLE:1;
      uint64_t reservedSpace1:2;
      uint64_t CBRR:1;
      uint64_t reservedSpace2:14;
      uint64_t SRAMUAP:2;
      uint64_t SRAMUWP:1;
      uint64_t reservedSpace3:1;
      uint64_t SRAMLAP:2;
      uint64_t SRAMLWP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCM_CPCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t FIOC:1;
      uint64_t FDZC:1;
      uint64_t FOFC:1;
      uint64_t FUFC:1;
      uint64_t FIXC:1;
      uint64_t reservedSpace1:2;
      uint64_t FIDC:1;
      uint64_t reservedSpace2:8;
      uint64_t FIOCE:1;
      uint64_t FDZCE:1;
      uint64_t FOFCE:1;
      uint64_t FUFCE:1;
      uint64_t FIXCE:1;
      uint64_t reservedSpace3:2;
      uint64_t FIDCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCM_ISCR;

  uint8_t res0[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCM_PID;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPOREQ:1;
      uint64_t CPOACK:1;
      uint64_t CPOWOI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCM_CPO;

  uint8_t res2[956];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CF0:4;
      uint64_t reservedSpace0:9;
      uint64_t MT:3;
      uint64_t LOCK:1;
      uint64_t DPW:3;
      uint64_t WY:4;
      uint64_t LMSZ:4;
      uint64_t LMSZH:1;
      uint64_t reservedSpace1:2;
      uint64_t V:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCM_LMDR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CF0:4;
      uint64_t reservedSpace0:9;
      uint64_t MT:3;
      uint64_t LOCK:1;
      uint64_t DPW:3;
      uint64_t WY:4;
      uint64_t LMSZ:4;
      uint64_t LMSZH:1;
      uint64_t reservedSpace1:2;
      uint64_t V:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCM_LMDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t CF1:4;
      uint64_t reservedSpace1:5;
      uint64_t MT:3;
      uint64_t LOCK:1;
      uint64_t DPW:3;
      uint64_t WY:4;
      uint64_t LMSZ:4;
      uint64_t LMSZH:1;
      uint64_t reservedSpace2:2;
      uint64_t V:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCM_LMDR2;

  uint8_t res3[116];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERNCR:1;
      uint64_t reservedSpace0:7;
      uint64_t ER1BR:1;
      uint64_t reservedSpace1:11;
      uint64_t ECPR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCM_LMPECR;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENC:8;
      uint64_t E1B:8;
      uint64_t PE:8;
      uint64_t PEELOC:5;
      uint64_t reservedSpace0:2;
      uint64_t V:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCM_LMPEIR;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFADD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCM_LMFAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PEFPRT:4;
      uint64_t PEFSIZE:3;
      uint64_t PEFW:1;
      uint64_t PEFMST:8;
      uint64_t reservedSpace0:15;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCM_LMFATR;

  uint8_t res6[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PEFDH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCM_LMFDHR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PEFDL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCM_LMFDLR;

};

#define MCM (*(volatile struct MCM_tag *) 0xe0080008)

struct LMEM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENCACHE:1;
      uint64_t reservedSpace0:1;
      uint64_t PCCR2:1;
      uint64_t PCCR3:1;
      uint64_t reservedSpace1:20;
      uint64_t INVW0:1;
      uint64_t PUSHW0:1;
      uint64_t INVW1:1;
      uint64_t PUSHW1:1;
      uint64_t reservedSpace2:3;
      uint64_t GO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LMEM_LMEM_PCCCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LGO:1;
      uint64_t reservedSpace0:1;
      uint64_t CACHEADDR:12;
      uint64_t WSEL:1;
      uint64_t reservedSpace1:1;
      uint64_t TDSEL:1;
      uint64_t reservedSpace2:3;
      uint64_t LCIVB:1;
      uint64_t LCIMB:1;
      uint64_t LCWAY:1;
      uint64_t reservedSpace3:1;
      uint64_t LCMD:2;
      uint64_t LADSEL:1;
      uint64_t LACC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LMEM_LMEM_PCCLCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LGO:1;
      uint64_t reservedSpace0:1;
      uint64_t PHYADDR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LMEM_LMEM_PCCSAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LMEM_LMEM_PCCCVR;

  uint8_t res0[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R15:2;
      uint64_t R14:2;
      uint64_t R13:2;
      uint64_t R12:2;
      uint64_t R11:2;
      uint64_t R10:2;
      uint64_t R9:2;
      uint64_t R8:2;
      uint64_t R7:2;
      uint64_t R6:2;
      uint64_t R5:2;
      uint64_t R4:2;
      uint64_t R3:2;
      uint64_t R2:2;
      uint64_t R1:2;
      uint64_t R0:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LMEM_PCCRMR;

};

#define LMEM (*(volatile struct LMEM_tag *) 0xe0082000)

